const initialState = {
  type:{
    'OSPT':{
      id:15,
      color:'#F29B95',
      info:'피지-염증-색소침착의 악순환이 반복되고 검은 점이 더 오래 남아 있는 피부입니다.',
      tag:[
        'Oily (지성)',
        'Sensitive (민감성)',
        'Pigment (색소성)',
        'Tight (탄력)'
      ],
      good:["1,알부틴","1,산뽕나무추출물","1,아젤라익애씨드","6-7,레조시놀","1,월귤추출물","1-3,살리실릭애씨드","0,오이추출물",'1,분홍바늘꽃추출물','4-7,코직애씨드','1,감초뿌리추출물','1,창과감초뿌리추출물','5,스페인감초뿌리추출물','1,나이아신아마이드',
      '1,아젤라익애씨드','6-9,레티놀','1-3,살리실릭애씨드','6-7,레조시놀','1,티트리잎오일','1,당아욱추출물','1,보스웰리아추출물','1,나이아신아마이드','1,우엉뿌리추출물','1,버독뿌리추출물','1,커먼버독뿌리추출물','1,홍조류추출물','2,마트리카리아추출물','1,프로방스장미꽃수',
      '1,다마스크장미꽃수','0,하얀장미꽃수','0,장미꽃수','1,오이','1-3,살리실릭애씨드','1,덱스판테놀','1,감초뿌리추출물','1,창과감초뿌리추출물','5,스페인감초뿌리추출물','1,티트리잎오일',
      ],
      bad:['1,라놀린','3-4,메틸파라벤','5-7,부틸파라벤','3-4,소듐메틸파라벤','5-7,소듐부틸파라벤','3,소듐에틸파라벤','5-8,소듐아이소부틸파라벤','4-6,소듐프로필파라벤','3,에틸파라벤','5-8,아이소부틸파라벤','4-7,아이소프로필파라벤','4-6,프로필파라벤','3-4,포타슘메틸파라벤','5-7,포타슘부틸파라벤',
      '3,포타슘에틸파라벤','1,포타슘파라벤','0,포타슘프로필파라벤','0,소듐아이소프로필파라벤','1,소듐파라벤','1,아이소데실파라벤','4,벤질파라벤','1,페녹시에틸파라벤','1,칼슘파라벤','1,헥사미딘다이파라벤','1,헥사미딘파라벤','0,운데실레노일피이지-5파라벤','4,향료','1,부틸스테아레이트','1,아이소스테아릴아이소스테아레이트','3,육계잎오일',
      '3,육계전초오일','1,아이소스테아릴네오펜타노에이트','1,카카오씨버터','1,코코넛야자오일','2-3,미리스틸미리스테이트','1,데실올리에이트','1,미리스틸프로피오네이트','1,아이소세틸스테아레이트','1,아이소프로필아이소스테아레이트','1,아이소프로필미리스테이트','4,페퍼민트오일','1,아이소프로필팔미테이트',
      ]
    },
    'OSPW':{
      id:16,
      color: '#F08964',
      info: '다양한 피부트러블과 함께 색소침착, 노화까지 겪고 있는 총체적 난국의 피부입니다.',
      tag:[
        'Oily (지성)',
        'Sensitive (민감성)',
        'Pigment (색소성)',
        'Wrinkle (주름)',
      ],
      good:['1,알부틴','1,오이','1,나이아신아마이드','1,월귤추출물','1,감초뿌리추출물','1,창과감초뿌리추출물','5,스페인감초뿌리추출물','1,산뽕나무추출물','1,티트리잎오일','6-9,레티놀','1-3,살리실릭애씨드','1,들깨잎추출물','2,아르니카 몬타나추출물','0,소나무껍질추출물','1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물','0,리기다소나무껍질추출물','0,올레오일소나무껍질추출물',
      '1,프랑스해안송껍질추출물','1,포트마리골드추출물','2,마트리카리아추출물','1,붉은토끼풀추출물','1,콜로이달오트밀','1,타임추출물','1,오이','1,분홍바늘꽃추출물','1,덱스판테놀','1,달맞이꽃오일','1,피버퓨추출물','1,녹차','1,포도씨추출물',
      '1,바질추출물','1,녹차','1,카페인','1,당근추출물','1,라이코펜','1,석류추출물','1,오이','0,소나무껍질추출물','1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물','0,리기다소나무껍질추출물','0,올레오일소나무껍질추출물','1,프랑스해안송껍질추출물','1,커큐민','1-2,페룰릭애씨드','1,로즈마리','1,피버퓨추출물',
      '0,홍삼','1,붉은토끼풀추출물','0,생강','0,유카잎/뿌리추출물',
      ],
      bad:['3,육계잎오일','3,육계전초오일','1,아이소프로필미리스테이트','1,카카오씨버터','4,페퍼민트오일','1,코코넛야자오일','1-2,소듐라우릴설페이트','1,아이소프로필아이소스테아레이트',
      ]      
    },
    'OSNT':{
      id:13,
      color: '#EE9BB6',
      info: '감정 변화나 다양한 자극으로 쉽게 얼굴이 붉어지고 곳곳에 여드름이 보이는 피부입니다.',
      tag:[
        'Oily (지성)',
        'Sensitive (민감성)',
        'Non-Pigment (비색소성)',
        'Tight (탄력)',
      ],
      good:['2,마트리카리아추출물','1,오이','1,덱스판테놀','1,피버퓨추출물','1,감초뿌리추출물','1,창과감초뿌리추출물','5,스페인감초뿌리추출물','1,나이아신아마이드','1-3,살리실릭애씨드','1,티트리잎오일',
      ],
      bad:['1,아세틱애씨드','1,알란토인','1-4,발삼페루수지','1,코코넛야자오일','1,아이소프로필아이소스테아레이트','1,아이소프로필미리스테이트','1-3,벤조익애씨드','1-2,캠퍼','1,신나믹애씨드','3,육계잎오일','3,육계전초오일','1-4,락틱애씨드','1,멘톨','3-4,메틸파라벤','5-7,부틸파라벤',
      '3-4,소듐메틸파라벤','5-7,소듐부틸파라벤','3,소듐에틸파라벤','5-8,소듐아이소부틸파라벤','4-6,소듐프로필파라벤','3,에틸파라벤','5-8,아이소부틸파라벤','4-7,아이소프로필파라벤','4-6,프로필파라벤','3-4,포타슘메틸파라벤','5-7,포타슘부틸파라벤','3,포타슘에틸파라벤','1,포타슘파라벤','0,포타슘프로필파라벤','0,소듐아이소프로필파라벤','1,소듐파라벤',
      '1,아이소데실파라벤','4,벤질파라벤','1,페녹시에틸파라벤','1,칼슘파라벤','1,헥사미딘다이파라벤','1,헥사미딘파라벤','0,운데실레노일피이지-5파라벤','4,페퍼민트오일','5-7,쿼터늄-15',
      ]     
    },
    'DSPW':{
      id:8,
      color: '#77C49D',
      info: '피부가 매우 민감하고 얇아 쉽게 반응을 보이며, 모든 종류의 문제를 보일 수 있는 피부입니다.',
      tag:[
        'Dry (건성)',
        'Sensitive (민감성)',
        'Pigment (색소성)',
        'Wrinkle (주름)',
      ],
      good:['1,알부틴','0,오이추출물','1,오이열매추출물','1,감초뿌리추출물','1,창과감초뿌리추출물','5,스페인감초뿌리추출물','1,마그네슘아스코빌포스페이트','4-7,코직애씨드','1,산뽕나무추출물','1,코코넛야자열매추출물','1,오이','1,나이아신아마이드','0,소나무껍질추출물',
      '1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물','0,리기다소나무껍질추출물','0,올레오일소나무껍질추출물','1,프랑스해안송껍질추출물','1,바위취추출물','1,뷰글추출물',
      '1,보리지씨오일','1,카놀라오일','1,콜레스테롤','1,콜로이달오트밀','1,덱스판테놀','1-3,다이메티콘','1,달맞이꽃오일','1-2,글리세린','1,퀸즈랜드넛오일','1,올리브오일','1,잇꽃씨오일','1,시어버터','2,마트리카리아추출물','1,콜로이달오트밀','1,오이','1,덱스판테놀',
      '1,달맞이꽃오일','1,피버퓨추출물','1,녹차','0,분꽃','1,들깨잎추출물','0,소나무껍질추출물','1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물','0,리기다소나무껍질추출물','0,올레오일소나무껍질추출물','1,프랑스해안송껍질추출물',
      '1,홍조류추출물','1,붉은토끼풀추출물','1,타임추출물','1,분홍바늘꽃추출물','1,은행추출물','1,아스코빅애씨드','1,바질추출물','1,카페인','1,녹차','1,당근추출물','1,유비퀴논','1,커큐민','1-2,페룰릭애씨드','1,피버퓨추출물','1,인삼','0,홍삼','1,포도씨추출물',
      '1,라이코펜','0,생강','1,석류추출물','0,소나무껍질추출물','1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물','0,리기다소나무껍질추출물','0,올레오일소나무껍질추출물','1,프랑스해안송껍질추출물','1,로즈마리','0,유카잎/뿌리추출물',
      ],
      bad:['3,육계잎오일','3,육계전초오일','1,코코넛야자오일','1,아이소프로필아이소스테아레이트','1,아이소프로필미리스테이트','1,아이소프로필팔미테이트','1,부틸스테아레이트','1,아이소스테아릴네오펜타노에이트','2-3,미리스틸미리스테이트','1,데실올리에이트','1,아이소세틸스테아레이트','1,미리스틸프로피오네이트',
      '1,라놀린','4,페퍼민트오일','1-4,락틱애씨드','1-4,글라이콜릭애씨드','1,글루코노락톤','2,파이틱애씨드','6-9,레티놀','6-9,레티닐팔미테이트',
      ]     
    },
    'DSPT':{
      id:7,
      color: '#8ACECC',
      info: '수많은 민감 증상으로 매순간 고통을 받으며, 특히 습진, 각질, 색소침착 등을 겪는 피부입니다.',
      tag:[
        'Dry (건성)',
        'Sensitive (민감성)',
        'Pigment (색소성)',
        'Tight (탄력)',
      ],
      good:['1,알부틴','1,월귤추출물','0,오이추출물','1,오이열매추출물','1,감초뿌리추출물','1,창과감초뿌리추출물','5,스페인감초뿌리추출물','1,산뽕나무추출물','1,코코넛야자열매추출물','1,나이아신아마이드','0,소나무껍질추출물','1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물',
      '0,리기다소나무껍질추출물','0,올레오일소나무껍질추출물','1,프랑스해안송껍질추출물','1,소이아이소플라본','2,마트리카리아추출물','1,콜로이달오트밀','1,오이','1,덱스판테놀','1,분홍바늘꽃추출물','1,달맞이꽃오일','1,피버퓨추출물','1,들깨잎추출물',
      '0,소나무껍질추출물','1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물','0,리기다소나무껍질추출물','0,올레오일소나무껍질추출물','1,프랑스해안송껍질추출물','1,홍조류추출물','1,타임추출물','1,붉은토끼풀추출물','1,보리지씨오일','2,피마자씨오일',
      '1,콜레스테롤','1,콜로이달오트밀','1,덱스판테놀','1-3,다이메티콘','1,달맞이꽃오일','1-2,글리세린','1,올리브오일','1,당호박씨오일','1,잇꽃씨오일','1,시어버터','1,해바라기씨오일',
      ],
      bad:['3-5,벤잘코늄클로라이드','4-5,p-클로로-m-크레졸','1-4,클로헥시딘','3-4,메틸파라벤','5-7,부틸파라벤','3-4,소듐메틸파라벤','5-7,소듐부틸파라벤','3,소듐에틸파라벤','5-8,소듐아이소부틸파라벤','4-6,소듐프로필파라벤','3,에틸파라벤','5-8,아이소부틸파라벤','4-7,아이소프로필파라벤','4-6,프로필파라벤','3-4,포타슘메틸파라벤',
      '5-7,포타슘부틸파라벤','3,포타슘에틸파라벤','1,포타슘파라벤','0,포타슘프로필파라벤','0,소듐아이소프로필파라벤','1,소듐파라벤','1,아이소데실파라벤','4,벤질파라벤','1,페녹시에틸파라벤','1,칼슘파라벤','1,헥사미딘다이파라벤','1,헥사미딘파라벤','0,운데실레노일피이지-5파라벤','3-5,디아졸리디닐우레아','2-4,페녹시에탄올','0,페닐머큐릭아세테이트',
      '5-7,쿼터늄-15','2,소르빅애씨드','0,티메로살','3-7,트리클로산','1,서양톱풀','1-2,일랑일랑꽃추출물','1,서양민들레추출물','3-4,커먼자스민추출물','1,라벤더추출물','1,레몬그라스추출물','1-3,레몬오일','5,오렌지오일','4,페퍼민트오일','3,사향장미오일','1,로즈마리','1,단향','1,티트리잎오일','3,육계잎오일','3,육계전초오일','1,코코넛야자오일','1,아이소프로필아이소스테아레이트','1,아이소프로필미리스테이트','4,페퍼민트오일','1-2,소듐라우릴설페이트',
      ] 
    },
    'DSNT':{
      id:5,
      color: '#D1E5AB',
      info: '사막에 있는 것처럼 심한 건조함과 화끈거림을 느끼며 각질과 붉은 기를 보이는 피부입니다.',
      tag:[
        'Dry (건성)',
        'Sensitive (민감성)',
        'Non-Pigment (비색소성)',
        'Tight (탄력)',
      ],
      good:['2,마트리카리아추출물','1,콜로이달오트밀','1,오이','1,덱스판테놀','1,분홍바늘꽃추출물','1,달맞이꽃오일','1,피버퓨추출물','1,들깨잎추출물','0,소나무껍질추출물','1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물','0,리기다소나무껍질추출물',
      '0,올레오일소나무껍질추출물','1,프랑스해안송껍질추출물','1,홍조류추출물','1,타임추출물','1,붉은토끼풀추출물','1,알부틴','0,오이추출물','1,오이열매추출물','1,감초뿌리추출물','1,창과감초뿌리추출물','5,스페인감초뿌리추출물','1,코코넛야자열매추출물','1,오이','1,나이아신아마이드','0,소나무껍질추출물','1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물','0,리기다소나무껍질추출물',
      '0,올레오일소나무껍질추출물','1,프랑스해안송껍질추출물','1,바위취추출물','0,콩','1,돌콩','1,보리지씨오일','2,피마자씨오일','1,콜레스테롤','1,콜로이달오트밀','1,덱스판테놀','1-3,다이메티콘','1,달맞이꽃오일','1-2,글리세린','1,올리브오일','1,당호박씨오일','1,잇꽃씨오일','1,해바라기씨오일',
      ],
      bad:['3-5,벤잘코늄클로라이드','4-5,p-클로로-m-크레졸','1-4,클로헥시딘','3-5,디아졸리디닐우레아','2-4,페녹시에탄올','3-6,디엠디엠하이단토인','3-5,이미다졸리디닐우레아','3-4,메틸파라벤','5-7,부틸파라벤','3-4,소듐메틸파라벤','5-7,소듐부틸파라벤','3,소듐에틸파라벤','5-8,소듐아이소부틸파라벤','4-6,소듐프로필파라벤','3,에틸파라벤',
      '5-8,아이소부틸파라벤','4-7,아이소프로필파라벤','4-6,프로필파라벤','3-4,포타슘메틸파라벤','5-7,포타슘부틸파라벤','3,포타슘에틸파라벤','1,포타슘파라벤','0,포타슘프로필파라벤','0,소듐아이소프로필파라벤','1,소듐파라벤','1,아이소데실파라벤','4,벤질파라벤','1,페녹시에틸파라벤','1,칼슘파라벤','1,헥사미딘다이파라벤',
      '1,헥사미딘파라벤','0,운데실레노일피이지-5파라벤','0,페닐머큐릭아세테이트','5-7,쿼터늄-15','2,소르빅애씨드','10,티메로살','3-7,트리클로산','3,육계잎오일','3,육계전초오일','1,코코넛야자오일','1,아이소프로필아이소스테아레이트','1,아이소프로필미리스테이트','4,페퍼민트오일','1-2,소듐라우릴설페이트',
      ]
    },    
    'OSNW':{
      id:14,
      color: '#E85881',
      info: '잘 익은 바닷가재처럼 햇빛에 쉽게 붉어지고 번들거리며 종종 여드름이 보이는 피부입니다.',
      tag:[
        'Oily (지성)',
        'Sensitive (민감성)',
        'Non-Pigment (비색소성)',
        'Wrinkle (주름)',
      ],
      good:['6-9,레티놀','1-3,살리실릭애씨드','1,티트리잎오일','1,바질추출물','1,보스웰리아추출물','1,우엉뿌리추출물','1,버독뿌리추출물','1,커먼버독뿌리추출물','2,마트리카리아추출물','1,덱스판테놀','1,분홍바늘꽃추출물','1,붉은토끼풀추출물','1,피버퓨추출물','0,생강','1,당아욱추출물','1,나이아신아마이드','1,홍조류추출물','1-3,살리실릭애씨드','1,티트리잎오일','1,바질추출물','1,카페인','1,녹차','1,유비퀴논','1,피버퓨추출물',
      '1,제니스테인','0,생강','1,인삼','0,홍삼','1,포도씨오일','1,라이코펜','1,석류추출물','0,소나무껍질추출물','1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물','0,리기다소나무껍질추출물','0,올레오일소나무껍질추출물','1,프랑스해안송껍질추출물','0,유카잎/뿌리추출물',
      ],
      bad:['3,아세톤','1,에탄올',
      ]
    },        
    'ORPW':{
      id:12,
      color: '#ED7100',
      info: '민감성 피부의 흔적으로 매일 아침마다 넓은 모공과 주름, 반점을 마주하는 피부입니다.',
      tag:[
        'Oily (지성)',
        'Resistant (저항성)',
        'Pigment (색소성)',
        'Wrinkle (주름)',
      ],
      good:['1,알부틴','1,월귤추출물','0,오이추출물','1,오이열매추출물','1,분홍바늘꽃추출물','1,갈릭애씨드','1,감초뿌리추출물','1,창과감초뿌리추출물','5,스페인감초뿌리추출물','4-7,코직애씨드','1,검은뽕나무열매추출물','1,뽕나무열매추출물','0,꾸지뽕나무열매추출물','1-3,살리실릭애씨드','1,코코넛야자열매즙','1,나이아신아마이드','1-4,글라이콜릭애씨드','1-4,락틱애씨드','1,카페인','1,유비퀴논','1,인삼',
      '0,홍삼','1,포도씨추출물','1,녹차',
      ],
      bad:['0,라케모사승마','1,라케모사승마뿌리추출물','1,체이스트트리추출물','1,호프','1,붉은토끼풀추출물','0,콩','1,돌콩','피부톤 다운','1,셀러리추출물','1-2,라임추출물','0,파슬리추출물','1,무화과추출물','1,당근추출물','1,베르가못오일','1-3,미네랄오일','1,코코넛야자오일','1-4,페트롤라툼',      
      ]
    },
    'DSNW':{
      id:6,
      color: '#A6CE58',
      info: '하루마다 피부 상태가 급변하고 가려움, 따가움, 홍초 등과 함께 주름이 보이는 피부입니다.',
      tag:[
        'Dry (건성)',
        'Sensitive (민감성)',
        'Non-Pigment (비색소성)',
        'Wrinkle (주름)',
      ],
      good:['1,뷰글추출물','1,보리지씨오일','1,카놀라오일','1,콜레스테롤','1,콜로이달오트밀','1,덱스판테놀','1-3,다이메티콘','1,달맞이꽃오일','1-2,글리세린','1,퀸즈랜드넛오일','1,올리브오일','1,잇꽃씨오일','1,시어버터','2,마트리카리아추출물','1,콜로이달오트밀','1,오이','1,덱스판테놀','1,분홍바늘꽃추출물','1,달맞이꽃오일','1,피버퓨추출물',
      '1,녹차','1,들깨잎추출물','0,소나무껍질추출물','1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물','0,리기다소나무껍질추출물','0,올레오일소나무껍질추출물','1,프랑스해안송껍질추출물','1,홍조류추출물','1,타임추출물','1,붉은토끼풀추출물','1,은행추출물','1,바질추출물','1,카페인','1,녹차','1,당근추출물','1,유비퀴논',
      '1,커큐민','1-2,페룰릭애씨드','1,피버퓨추출물','1,제니스테인','1,인삼','0,홍삼','1,포도씨추출물','1,라이코펜','0,소나무껍질추출물','1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물','0,리기다소나무껍질추출물','0,올레오일소나무껍질추출물','1,프랑스해안송껍질추출물','1,로즈마리','0,생강','0,유카잎/뿌리추출물',
      ],
      bad:['2,피마자씨오일','2-3,프로필갈레이트','1,리시놀레익애씨드','1,부틸스테아레이트','3,육계잎오일','3,육계전초오일','1,코코넛야자오일','1,데실올리에이트','1,아이소세틸스테아레이트','1,아이소프로필아이소스테아레이트','1,아이소프로필미리스테이트','1,아이소프로필팔미테이트','1,아이소스테아릴네오펜타노에이트','1,라놀린','2-3,미리스틸미리스테이트','1,미리스틸프로피오네이트','4,페퍼민트오일','1-4,락틱애씨드','1-4,글라이콜릭애씨드','1,글루코노락톤',
      '2,파이틱애씨드','6-9,레티놀','6-9,레티닐팔미테이트','1-3,살리실릭애씨드','1,아스코빅애씨드',
      ]
    },
    'DRPW':{
      id:4,
      color: '#42A7DB',
      info: '과거 피부에 문제가 없어 방치하였으나, 지금은 검은 반점과 주름을 가진 피부입니다.',
      tag:[
        'Dry (건성)',
        'Resistant (저항성)',
        'Pigment (색소성)',
        'Wrinkle (주름)',
      ],
      good:['1,알부틴','4-7,코직애씨드','1,아스코빅애씨드','1,마그네슘아스코빌포스페이트','0,오이추출물','1,오이열매추출물','1,산뽕나무추출물','1,감초뿌리추출물','1,창과감초뿌리추출물','5,스페인감초뿌리추출물','1,코코넛야자열매추출물','0,소나무껍질추출물','1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물','0,리기다소나무껍질추출물','0,올레오일소나무껍질추출물','1,프랑스해안송껍질추출물','1,오이','1,바위취추출물',
      '1,나이아신아마이드','1-2,글리세린','1,보리지씨오일','1,콜레스테롤','1-4,락틱애씨드','1,리놀레익애씨드','1,콜로이달오트밀','1,나이아신아마이드','1-4,글라이콜릭애씨드','1,덱스판테놀','1,올리브오일','1-3,다이메티콘','1,잇꽃씨오일','1,달맞이꽃오일','1,시어버터','1-4,락틱애씨드','1-4,글라이콜릭애씨드','6-9,레티놀','1,아스코빅애씨드','1,바질추출물',
      '1,포도씨오일','1,카페인','1,녹차','1,유비퀴논','1,라이코펜','1,석류추출물','1,커큐민','0,소나무껍질추출물','1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물','0,리기다소나무껍질추출물','0,올레오일소나무껍질추출물','1,프랑스해안송껍질추출물','1-2,페룰릭애씨드','1,로즈마리','1,피버퓨추출물','0,생강','1,아스코빅애씨드','1,인삼','0,홍삼','1,토코페롤','0,유카잎/뿌리추출물',
      ],
      bad:['1,에탄올','1-3,미리스타미도프로필베타인','1,미리스타민옥사이드','1,미리스틸알코올','1-3,바바수아미도프로필베타인','1,베헤닐베타인','1,세테아릴알코올','1,세틸베타인','1,세틸알코올','1,소듐데실설페이트','1,소듐라우로암포아세테이트','1,소듐코코암포아세테이트','1,소듐코코암포프로피오네이트','1,소듐코코일하이드롤라이즈드밀단백질글루타메이트','1,소듐탈로우에이트','1-3,소듐피이지-7올리브오일카복실레이트','1-6,소듐피이지-4코카마이드설페이트','1,소이아미도프로필아민옥사이드','1,스테아라마이드에이엠피','1,스테아라마이드엠이에이',
      '1,스테아라민옥사이드','1,스테아릴알코올','1,올레아마이드미파','1-3,올레아미도프로필베타인','1,올레아민옥사이드','1,올레일베타인','1,카르니틴','1,코카마이드미파','1-4,코카마이드엠이에이','1,코카미노프로피오닉애씨드','1-6,코카미도프로필베타인','1-4,코카미도프로필베타인아마이드엠이에이클로라이드','1,코카미도프로필아민옥사이드','1,코카미도프로필하이드록시설테인','1,코카민옥사이드','1,코코넛알코올','1,코코-베타인','1,쿼터늄-92','1-3,탈로우아마이드엠이에이',
      '1-6,피이지-2스테아라민','1-3,피이지-2올레아민','1-3,피이지-3코카마이드','1-7,피이지-2하이드로제네이티드탈로우아민','1-3,피피지-2코카마이드','1,아몬드아미도프로필아민옥사이드',
      ]
    },    
    'ORPT':{
      id:11,
      color: '#FABE00',
      info: '자외선으로 주근깨와 검은 반점이 쉽게 생겨 고민이지만 장점이 훨씬 많은 피부입니다.',
      tag:[
        'Oily (지성)',
        'Resistant (저항성)',
        'Pigment (색소성)',
        'Tight (탄력)',
      ],
      good:['1,알부틴','1,월귤추출물','0,오이추출물','1,오이열매추출물','4-7,코직애씨드','1,스페인감초뿌리줄기/뿌리','1,산뽕나무추출물','1,나이아신아마이드','6-9,레티놀','1-3,살리실릭애씨드','1,아스코빅애씨드','1-3,살리실릭애씨드','6-9,레티놀','1-2,시트릭애씨드','1-4,글라이콜릭애씨드','1-4,락틱애씨드','2,파이틱애씨드',
      ],
      bad:['1,제니스테인','0,콩','1,돌콩','1,소이아이소플라본','1,셀러리추출물','1-2,라임추출물','0,파슬리추출물','1,무화과추출물','1,당근추출물','1,베르가못오일',
      ]
    },
    'ORNT':{
      id:9,
      color: '#FCD25C',
      info: '번들거림은 있으나, 어느 것 하나 흠 잡을 곳 없이 광채가 나는 피부입니다.',
      tag:[
        'Oily (지성)',
        'Resistant (저항성)',
        'Non-Pigment (비색소성)',
        'Tight (탄력)',
      ],
      good:[
      ],
      bad:['1,보리지씨오일','1-3,미네랄오일','1,해바라기씨오일','1-4,페트롤라툼',
      ]
    },
    'ORNW':{
      id:10,
      color: '#FABE00',
      info: '피부 트러블이 없어 피부에 관심이 적으나, 주름과 노화가 눈에 띄는 피부입니다.',
      tag:[
        'Oily (지성)',
        'Resistant (저항성)',
        'Non-Pigment (비색소성)',
        'Wrinkle (주름)',
      ],
      good:['1-4,락틱애씨드','2,파이틱애씨드','6-9,레티놀','1-4,글라이콜릭애씨드','1-3,살리실릭애씨드','1,아스코빅애씨드','1,카페인','1,유비퀴논','1,인삼','0,홍삼','1,포도씨추출물','1,녹차','1,호프','1,라이코펜','1,드럼스틱잎추출물','0,소나무껍질추출물','1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물',
      '0,리기다소나무껍질추출물','0,올레오일소나무껍질추출물','1,프랑스해안송껍질추출물','1,석류추출물','1,레스베라트롤','1,로즈마리','1,아스코빅애씨드','1,토코페롤',
      ],
      bad:['1-3,미네랄오일','1-4,페트롤라툼','1,잇꽃씨오일',
      ]
    },
    'DRPT':{
      id:3,
      color: '#96B5DF',
      info: '자외선으로 기미, 검은 반점이 나타나기 쉽지만 아름답게 관리할 수 있는 피부입니다.',
      tag:[
        'Dry (건성)',
        'Resistant (저항성)',
        'Pigment (색소성)',
        'Tight (탄력)',
      ],
      good:['1,알부틴','4-7,코직애씨드','1,검은뽕나무열매추출물','1,뽕나무열매추출물','0,꾸지뽕나무열매추출물','1,코코넛야자열매즙','1,나이아신아마이드','0,오이추출물','6-7,레조시놀','1,분홍바늘꽃추출물','6-9,레티놀','1,갈릭애씨드','1-3,살리실릭애씨드','1,감초뿌리추출물','1,바위취추출물','1,아스코빅애씨드','1,뷰글추출물','1,달맞이꽃오일','1,보리지씨오일','1,카놀라오일','1,라놀린','1,퀸즈랜드넛오일','1,콜레스테롤',
      '1,올리브오일','1-2,글리세린','0,로즈힙씨오일','1,콜로이달오트밀','1,잇꽃씨오일','1,덱스판테놀','1,시어버터','1-3,다이메티콘',
      ],
      bad:['1,소이아이소플라본','1,제니스테인',
      ]
    },
    'DRNW':{
      id:2,
      color: '#7C86C1',
      info: '젊었을 때 좋은 피부를 유지하지만, 건조함과 함께 빠른 노화를 겪는 피부입니다.',
      tag:[
        'Dry (건성)',
        'Resistant (저항성)',
        'Non-Pigment (비색소성)',
        'Wrinkle (주름)',
      ],
      good:['1,뷰글추출물','1,덱스판테놀','1-3,다이메티콘','1,달맞이꽃오일','1,보리지씨오일','1-2,글리세린','1,카놀라오일','1,퀸즈랜드넛오일','1,콜레스테롤','1,올리브오일','1,잇꽃씨오일','1,콜로이달오트밀','1,시어버터','1-4,락틱애씨드','1-2,시트릭애씨드','2,파이틱애씨드','1,글루코노락톤',
      '6-9,레티놀','1,바질추출물','1,인삼','0,홍삼','1,카페인','1,포도씨추출물','1,녹차','1,당근추출물','1,라이코펜','1,유비퀴논','1,피톨','1,석류추출물','1,커큐민','1-2,페룰릭애씨드','0,소나무껍질추출물','1-2,구주소나무껍질추출물','1,라디아타소나무껍질추출물','1-2,흰소나무껍질추출물','0,리기다소나무껍질추출물','0,올레오일소나무껍질추출물','1,프랑스해안송껍질추출물','1,피버퓨추출물','1,로즈마리','1,제니스테인','0,생강','0,유카잎/뿌리추출물',
      ],
      bad:['1-3,미리스타미도프로필베타인','1,미리스타민옥사이드','1,미리스틸알코올','1-3,바바수아미도프로필베타인','1,베헤닐베타인','1,세테아릴알코올','1,세틸베타인','1,세틸알코올','1,소듐데실설페이트','1,소듐라우로암포아세테이트','1,소듐코코암포아세테이트','1,소듐코코암포프로피오네이트','1,소듐코코일하이드롤라이즈드밀단백질글루타메이트','1,소듐탈로우에이트','1-3,소듐피이지-7올리브오일카복실레이트','1-6,소듐피이지-4코카마이드설페이트','1,소이아미도프로필아민옥사이드','1,스테아라마이드에이엠피','1,스테아라마이드엠이에이',
      '1,스테아라민옥사이드','1,스테아릴알코올','1,올레아마이드미파','1-3,올레아미도프로필베타인','1,올레아민옥사이드','1,올레일베타인','1,카르니틴','1,코카마이드미파','1-4,코카마이드엠이에이','1,코카미노프로피오닉애씨드','1-6,코카미도프로필베타인','1-4,코카미도프로필베타인아마이드엠이에이클로라이드','1,코카미도프로필아민옥사이드','1,코카미도프로필하이드록시설테인','1,코카민옥사이드','1,코코넛알코올','1,코코-베타인','1,쿼터늄-92',
      '1-3,탈로우아마이드엠이에이','1-6,피이지-2스테아라민','1-3,피이지-2올레아민','1-3,피이지-3코카마이드','1-7,피이지-2하이드로제네이티드탈로우아민','1-3,피피지-2코카마이드','1,아몬드아미도프로필아민옥사이드',
      ]
    },
    'DRNT':{
      id:1,
      color: '#B2B5DB',
      info: '피부 복권에 당첨된 것처럼 피부 결이 좋고 깨끗한 피부입니다.',
      tag:[
        'Dry (건성)',
        'Resistant (저항성)',
        'Non-Pigment (비색소성)',
        'Tight (탄력)',
      ],
      good:['1,비즈왁스','1,파라핀','1-3,다이메티콘','1-4,페트롤라툼','1,포도씨오일','2-3,프로필렌글라이콜','1,제니스테인','1,라놀린','1-3,미네랄오일','1,스쿠알란','1-4,락틱애씨드','1-4,글라이콜릭애씨드','1,하이알루로닉애씨드','1,솔비톨','1-2,글리세린','2-3,프로필렌글라이콜',
      '1-3,우레아','1,달맞이꽃오일','1,보리지씨오일','1,카놀라오일','1,나이아신아마이드','1,콜레스테롤','1,올리브오일','1,잇꽃씨오일','1,콜로이달오트밀','1,시어버터','1,덱스판테놀',
      ],
      bad:['3,아세톤','1,에탄올','1,변성알코올','3-6,메틸알코올','4,벤질알코올','2,아이소프로필알코올',
      ]
    },
  },
  type_info:{
    'Oily (지성)': '번들거림이 보이고 여드름이 나타나는 피부',
    'Dry (건성)' : '건조함을 느끼며 각질이 나타나는 피부',
    'Sensitive (민감성)': '피부 트러블 및 피부 자극으로, 예민하게 반응하는 피부',
    'Resistant (저항성)': '특별한 피부 문제 없이 피부장벽이 튼튼한 피부',
    'Pigment (색소성)':'기미, 잡티, 색소침착이 쉽게 나타나는 피부',
    'Non-Pigment (비색소성)': '기미, 잡티, 색소침착이 쉽게 나타나지 않는 피부',
    'Tight (탄력)': '주름이 보이지 않으며, 젊고 탱탱한 피부',
    'Wrinkle (주름)': '탄력이 줄어들고 노화가 시작된 피부',
  }
}
const skin = (state = initialState, action) => {
  switch (action.type) {
    case 'GET_SKIN_TYPE':
      return state;
    default:
      return state;
  }
}

export default skin;